<template>
    <div>
        <div class="text-base font-semibold mt-2 text-slate-600 dark:text-slate-400">ระบบที่เคยพัฒนา</div>

        <div class="rounded-lg p-2 bg-white  dark:bg-gray-900 my-2" v-for=" row in workData" :key="row.work">
            <p class="text-xs font-semibold text-slate-600 dark:text-slate-400">{{ row.work }}
            </p>
            <p class="block text-xs my-2">
                {{ row.workDetail }}
            </p>
        </div>


    </div>
</template>
<script setup >

const workData = [
    {
        work: 'ระบบจัดการสินทรัพย์',
        workDetail: 'บริหารจัดการ สินทรัพย์ สามารถ เบิก จ่าย และ นับ สินทรัพย์ ได้ และสามารถดูความเคลื่อนไหวของสินทรัพย์ และ\
                ยอดรวมของ สินทรัพย์',
    }, {
        work: 'ระบบจัดการทรัพยากรมนุษย์',
        workDetail: 'บริหารจัดการ ทรัพยากรมนุษย์ สามารถ เพิ่ม ลบ แก้ไข เปลี่ยนสถานะ ของแต่ละบุคคลได้ สามารถ เช็คอินได้\
                และสามารถเรียกดูข้อมูล ต่างๆ ของแต่ละบุคคล และแจ้งเตือนผ่านในไลน์',

    }, {
        work: 'ระบบการตรวจโควิด',
        workDetail: 'สามารถบันทึก การตรวจโควิดของแต่ละบุคคล และ สามารถเรียกดูข้อมูลได้ว่าได้ทำการตรวจไปกี่ครั้งและครั้งที่เท่าไหร่ สามารถ ระบุ สถานะของการตรวจได้ว่า ไม่พบเชื้อ หรือ พบเชื้อ หรือได้ทำการตรวจไปแล้ว',

    }, {
        work: 'ระบบเก็บข้อมูลสินค้า',
        workDetail: 'สามารถเก็บข้อมูลสินค้าได้ สามารถที่จะ Import Export ได้ และ สามารถ แก้ไขข้อมูลของสินค้าได้ และสามารถ\
                ปริ้น ข้อมูลสินค้าได้',
    }, {
        work: 'ระบบการนับพาเลท',
        workDetail: 'สามารถใช้ตรวจนับ พาเลท และ เทียบกับการนับรอบที่แล้ว และออกรายงานได้',
    }, {
        work: 'ระบบการโอนพาเลท',
        workDetail: 'สามารถใช้ รับพาเลท โอนพาเลท และยกเลิกการโอนพาเลทได้',
    }, {
        work: 'ระบบใบผ่าน และ ประตูลงสินค้า',
        workDetail: 'สามารถบันทึกใบผ่าน บันทึกข้อมูลพนักงานขับรถ และ บันทึกข้อมูลการลงสินค้า ได้ และสามารถ Import Export ขอมูลได้',
    }
]
</script>